a = ['3天前出现心慌，心率102次/分，没有治疗，没有服用药物，目前心慌，血压122/86，心跳93次/分。为进一步治疗，特来咨询。（2023-05-14填写）', '165cm，54kg（2023-05-14测量）', '心慌3天（2023-05-14填写）', '3天', '海珠区中医院体检 ', '无', '(2023-05-14填写)', '无(2023-05-14填写)', '手术：无 (2023-05-14填写)', '需要服用啥药治疗']


b = ['3天前出现心慌，心率102次/分，没有治疗，没有服用药物，目前心慌，血压122/86，心跳93次/分。为进一步治疗，特来咨询。（2023-05-14填写）', '165cm，54kg（2023-05-14测量）', '心慌3天（2023-05-14填写）', '3天', '海珠区中医院体检 ', '无', '(2023-05-14填写)', '无(2023-05-14填写)', '手术：无 (2023-05-14填写)', '重大疾病：无 (2023-05-14填写)', '放化疗：无 (2023-05-14填写)', '慢性疾病：无 (2023-05-14填写)', '需要服用啥药治疗']

c = []
i=0
h=0
while len(a) != len(b):
    if a[i] == b[i]:
        c.append(a[i])
        i = i + 1
        h = i
    else:
        if h == i:
            h = h-1
        c[h] = c[h] + b[i]
        del b[i]
        if len(a) == len(b):
            c.append(a[i])

print(c)